In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

# series

In [2]:
s1=pd.Series([1,2,3,4,5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
s2=pd.Series((1,2,3,4,5))
s2

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
s3=pd.Series({'name':'subhram','roll':'19CSE260','Age':21})
s3

name     subhram
roll    19CSE260
Age           21
dtype: object

## DataFrame : (combination of pandas series)

In [5]:
dict1={
    'Name':['subhram','sourav','mayank','raja','bipluv','smruti'],
    'Roll':['260','023','115','226','054','039'],
    'Age':['21','19','20','22','23','18']
}

df=pd.DataFrame(dict1)
df

      Name Roll Age
0  subhram  260  21
1   sourav  023  19
2   mayank  115  20
3     raja  226  22
4   bipluv  054  23
5   smruti  039  18

In [6]:
df.shape

(6, 3)

In [7]:
df.describe()

           Name Roll Age
count         6    6   6
unique        6    6   6
top     subhram  260  21
freq          1    1   1

In [8]:
len(df)

6

In [9]:
dct={
    "Name":["A","B","C","D","E","F","G","H","I","J"],
    "Age": [23,56,67,25,19,32,34,42,47,51],
    "Occupation":["S","B","J","S","J","B","B","J","J","J"],
    "Organization":["Sc","St","W","Sc","W","St","St","T","T","W"]
}
data=pd.DataFrame(dct)
data

  Name  Age Occupation Organization
0    A   23          S           Sc
1    B   56          B           St
2    C   67          J            W
3    D   25          S           Sc
4    E   19          J            W
5    F   32          B           St
6    G   34          B           St
7    H   42          J            T
8    I   47          J            T
9    J   51          J            W

In [10]:
data.describe()

             Age
count  10.000000
mean   39.600000
std    15.678719
min    19.000000
25%    26.750000
50%    38.000000
75%    50.000000
max    67.000000

## Accessing the column

In [11]:
data['Name']

0    A
1    B
2    C
3    D
4    E
5    F
6    G
7    H
8    I
9    J
Name: Name, dtype: object

In [12]:
data[['Name','Age']]

  Name  Age
0    A   23
1    B   56
2    C   67
3    D   25
4    E   19
5    F   32
6    G   34
7    H   42
8    I   47
9    J   51

## Finding columns Names

In [13]:
col=data.columns.tolist()
col

['Name', 'Age', 'Occupation', 'Organization']

## Read specific column data

In [14]:
df[col[0]]

0    subhram
1     sourav
2     mayank
3       raja
4     bipluv
5     smruti
Name: Name, dtype: object

In [15]:
df['Name']

0    subhram
1     sourav
2     mayank
3       raja
4     bipluv
5     smruti
Name: Name, dtype: object

In [16]:
df.Name

0    subhram
1     sourav
2     mayank
3       raja
4     bipluv
5     smruti
Name: Name, dtype: object

In [17]:
df[col[0:2]]

      Name Age
0  subhram  21
1   sourav  19
2   mayank  20
3     raja  22
4   bipluv  23
5   smruti  18

# Process - 1
## iloc() : (Accessing rows)

In [18]:
data.iloc[0]

Name             A
Age             23
Occupation       S
Organization    Sc
Name: 0, dtype: object

In [19]:
data.iloc[2:4]

  Name  Age Occupation Organization
2    C   67          J            W
3    D   25          S           Sc

In [20]:
data.iloc[2:9,:5]

  Name  Age Occupation Organization
2    C   67          J            W
3    D   25          S           Sc
4    E   19          J            W
5    F   32          B           St
6    G   34          B           St
7    H   42          J            T
8    I   47          J            T

# Process - 2
## Conditional Access

In [21]:
data[data['Age']>30]

  Name  Age Occupation Organization
1    B   56          B           St
2    C   67          J            W
5    F   32          B           St
6    G   34          B           St
7    H   42          J            T
8    I   47          J            T
9    J   51          J            W

In [22]:
data[(data['Age']>30)&(data['Occupation']=='B')]

  Name  Age Occupation Organization
1    B   56          B           St
5    F   32          B           St
6    G   34          B           St

# Data Processing & Cleaning

In [23]:
dct={
    "Name":["A",np.nan,"B","C","D","E",np.nan,"F","G","H","I","J"],
    "Age": [23,56,67,25,np.nan,19,32,34,42,np.nan,47,51],
    "Occupation":["S","B","J",np.nan,"S","J",np.nan,"B","B","J","J","J"],
    "Organization":["Sc",np.nan,"St","W","Sc",np.nan,"W","St","St","T","T","W"]
}
df1=pd.DataFrame(dct)
df1

   Name   Age Occupation Organization
0     A  23.0          S           Sc
1   NaN  56.0          B          NaN
2     B  67.0          J           St
3     C  25.0        NaN            W
4     D   NaN          S           Sc
5     E  19.0          J          NaN
6   NaN  32.0        NaN            W
7     F  34.0          B           St
8     G  42.0          B           St
9     H   NaN          J            T
10    I  47.0          J            T
11    J  51.0          J            W

In [24]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          10 non-null     object
 1   Age           10 non-null     float64
 2   Occupation    10 non-null     object
 3   Organization  10 non-null     object
dtypes: float64(1), object(3)
memory usage: 512.0+ bytes

In [25]:
df1.isna().sum()

Name            2
Age             2
Occupation      2
Organization    2
dtype: int64

# Cleaning
### 1. dropna() : All the Row containing NAN values will be removed from dataframe
### 2. fillna() : the NAN value will be replaced by some other user defined value

In [26]:
df1.fillna(df1.mean())

C:\Users\ASUS\AppData\Local\Temp/ipykernel_5284/4288736220.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df1.fillna(df1.mean())

   Name   Age Occupation Organization
0     A  23.0          S           Sc
1   NaN  56.0          B          NaN
2     B  67.0          J           St
3     C  25.0        NaN            W
4     D  39.6          S           Sc
5     E  19.0          J          NaN
6   NaN  32.0        NaN            W
7     F  34.0          B           St
8     G  42.0          B           St
9     H  39.6          J            T
10    I  47.0          J            T
11    J  51.0          J            W

In [27]:
df1.fillna('X',inplace=True)
df1

   Name   Age Occupation Organization
0     A  23.0          S           Sc
1     X  56.0          B            X
2     B  67.0          J           St
3     C  25.0          X            W
4     D     X          S           Sc
5     E  19.0          J            X
6     X  32.0          X            W
7     F  34.0          B           St
8     G  42.0          B           St
9     H     X          J            T
10    I  47.0          J            T
11    J  51.0          J            W

In [28]:
df1.isnull()

     Name    Age  Occupation  Organization
0   False  False       False         False
1   False  False       False         False
2   False  False       False         False
3   False  False       False         False
4   False  False       False         False
5   False  False       False         False
6   False  False       False         False
7   False  False       False         False
8   False  False       False         False
9   False  False       False         False
10  False  False       False         False
11  False  False       False         False

In [29]:
df1.isnull().sum()

Name            0
Age             0
Occupation      0
Organization    0
dtype: int64

# Question (Dataset : data)

#### 1. Show the details of the people with age between 32-35
#### 2. Filter and show the details of the people who are doing jobs and business
#### 3. Show the average age of the people  who do their job in TATA
#### 4. Compare the average age of people by occupation Category
#### 5.  Show the details of the people where the name is the Vowel

In [30]:
data

  Name  Age Occupation Organization
0    A   23          S           Sc
1    B   56          B           St
2    C   67          J            W
3    D   25          S           Sc
4    E   19          J            W
5    F   32          B           St
6    G   34          B           St
7    H   42          J            T
8    I   47          J            T
9    J   51          J            W

In [31]:
data[(32<data.Age)&(data.Age<45)]

  Name  Age Occupation Organization
6    G   34          B           St
7    H   42          J            T

In [32]:
data[(data.Occupation=='S')|(data.Occupation=='J')]

  Name  Age Occupation Organization
0    A   23          S           Sc
2    C   67          J            W
3    D   25          S           Sc
4    E   19          J            W
7    H   42          J            T
8    I   47          J            T
9    J   51          J            W

In [33]:
data[data.Organization=='T']['Age'].mean()

44.5

In [34]:
data.groupby('Occupation').mean()

                  Age
Occupation
B           40.666667
J           45.200000
S           24.000000

In [35]:
data[(data.Name=='A')|(data.Name=='E')|(data.Name=='I')|(data.Name=='O')|(data.Name=='U')]

  Name  Age Occupation Organization
0    A   23          S           Sc
4    E   19          J            W
8    I   47          J            T

## Add column in existing dataframe

In [36]:
lndf=len(df1)
newdata=range(lndf)
df1['Newdata']=newdata
df1

   Name   Age Occupation Organization  Newdata
0     A  23.0          S           Sc        0
1     X  56.0          B            X        1
2     B  67.0          J           St        2
3     C  25.0          X            W        3
4     D     X          S           Sc        4
5     E  19.0          J            X        5
6     X  32.0          X            W        6
7     F  34.0          B           St        7
8     G  42.0          B           St        8
9     H     X          J            T        9
10    I  47.0          J            T       10
11    J  51.0          J            W       11

## Delete column in existing dataframe

In [37]:
df1.drop('Newdata',axis=1,inplace=True)
df1

   Name   Age Occupation Organization
0     A  23.0          S           Sc
1     X  56.0          B            X
2     B  67.0          J           St
3     C  25.0          X            W
4     D     X          S           Sc
5     E  19.0          J            X
6     X  32.0          X            W
7     F  34.0          B           St
8     G  42.0          B           St
9     H     X          J            T
10    I  47.0          J            T
11    J  51.0          J            W

In [38]:
df1.drop(['Newdata','Occupation'],axis=1)

KeyError: "['Newdata'] not found in axis"

### 1. Try to remove row 3,4 from fd1

In [ ]:
df1.drop([3,4],axis=0,inplace=True)
df1

## DataFrame Concatenation

In [ ]:
df2=df1.iloc[:3]
df3=df1.iloc[5:8]
print(df2,"\n\n",df3)
pd.concat([df2,df3])

## Inserting  of column in dataframe

In [ ]:
df1.drop(df1["Newdata"],axis=1)

In [ ]:
lndf=len(df1)
newdata=range(lndf)
df1=df1.insert(1,"Newdata",newdata)
df1

In [ ]:
dct={
    "Name":["A",np.nan,"B","C","D","E",np.nan,"F","G","H","I","J"],
    "Age": [23,56,67,25,np.nan,19,32,34,42,np.nan,47,51],
    "Occupation":["S","B","J",np.nan,"S","J",np.nan,"B","B","J","J","J"],
    "Organization":["Sc",np.nan,"St","W","Sc",np.nan,"W","St","St","T","T","W"]
}
data1=pd.DataFrame(dct)
data1

In [ ]:
data1

In [ ]:
lnd=len(data1)
newdata1=range(lnd)
data1.insert(1,"Newdata",newdata1)
data1

### 1. Create and insert new column where the average of newdata and age will be store

In [ ]:
data1("Age","Newdata").mean()

# Data Visualization

In [ ]:
a = df1['Occupation'].value_counts()
aindx = a.index.tolist()
aval = a.tolist()
print(aindx)
print(aval)

In [ ]:
plt.figure(figsize=(7,4))
plt.title("Count of occupation",fontsize=15,color="b")
plt.bar(aindx,aval,color=[ 'red', 'cyan', 'blue'],alpha=0.3)
plt.xlabel("Occupation",fontsize=13,color="b")
plt.ylabel("Count",fontsize=13,color="b")
plt.grid()
plt.show()

In [ ]:
plt.barh(aindx,aval,color=[ 'red', 'cyan', 'blue'],alpha=1)
plt.grid()
plt.show()

In [ ]:
my_labels = aindx
explode=(0,0,0.1)
plt.pie(aval,labels=my_labels,autopct='%1.1f%%',explode=explode)
plt.title('Pie Chart for Occupation\n',fontsize=13,color="b")

plt.show()

In [ ]:
df1

In [ ]:
import plotly.express as px
df1 = px.data.tips()
fig = px.pie(df1['Occupation'].value_counts(), values=aindx, names=aval)
fig.show()